In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'A':[1,2,np.nan],'B':[7,np.nan,np.nan],'C':[6,2,np.nan]}

In [3]:
d

{'A': [1, 2, nan], 'B': [7, nan, nan], 'C': [6, 2, nan]}

In [4]:
df = pd.DataFrame(d)

In [5]:
df

     A    B    C
0  1.0  7.0  6.0
1  2.0  NaN  2.0
2  NaN  NaN  NaN

In [6]:
df.dropna()  # Drop the row that have any nan value by default

     A    B    C
0  1.0  7.0  6.0

In [7]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [9]:
df.dropna(thresh=2)  # Atleast has two non nan values

     A    B    C
0  1.0  7.0  6.0
1  2.0  NaN  2.0

In [10]:
df.fillna(value='Fill Value')

            A           B           C
0         1.0         7.0         6.0
1         2.0  Fill Value         2.0
2  Fill Value  Fill Value  Fill Value

In [12]:
df.fillna(value=df['A'].mean())

     A    B    C
0  1.0  7.0  6.0
1  2.0  1.5  2.0
2  1.5  1.5  1.5